app/controllers/favorites_controller.rb

	def create
		@movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-18 22:42:00.214333"], ["movie_id", 1], ["updated_at", "2015-02-18 22:42:00.214333"], ["user_id", 1]]

	def destroy
		favorite = current_user.favorites.find(params[:id]) #params[:id] CONTAINS THE FAV ID THAT IT IS THE SECOND IN THE DELETE ROUTE.
		favorite.destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 10]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 1], ["id", 10]]