app/controllers/movies_controller.rb

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 1 LIMIT 1  [["user_id", 1]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @fans = @movie.fans
    @genres = @movie.genres
    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie)

UPDATE "movies" SET "slug" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["slug", "iron-man-redux"], ["updated_at", "2015-03-15 13:40:00.995595"]]
---
  def update
    if @movie.update(movie_params)

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])