app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "god thank that this doesn't even exists!"], ["created_at", "2015-02-10 22:49:01.781476"], ["movie_id", 6], ["stars", 1], ["updated_at", "2015-02-10 22:49:01.781476"], ["user_id", 1]]

  def set_movie
    # @movie = Movie.find(params[:movie_id])
    @movie = Movie.find_by!(slug: params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1