app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "slug", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$ADGy1DVNckzUUX5kMyTQCueZhgy3lD3DLROK7YNSp2tv2Wap54ls2"], ["updated_at", "2015-02-02 21:18:56.274570"]]
---
	def update
		# @user = User.find(params[:id])
		# BECAUSE THE BEFORE_ACTION METHOD "REQUIRE_CORRECT_USER" IS ALREADY FINDING THE USER AND THIS METHOD WILL
		# RUN BEFORE EDIT, UPDATE AND DESTROY, THEN WE CAN REMOVE THIS LINE FROM EACH ACTION
		if @user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."slug" = 'test123' LIMIT 1
---
	def set_user
		@user = User.find_by!(slug: params[:id])